Repository: sslavik/acdat
Catalog: TMXParser/en-es.tmx
Source language: en
Languages: es

source: This function is an alias to imap_headerinfo() and is identical to it in every way.
es: Si quiere conocer si un mensaje es Unseen, debe comprobarlo asi Unseen == 'U' _BAR_ _BAR_ Recent == 'N 'toaddress (la linea to: al completo, hasta 1024 caracteres) to[] (devuelve un array de objetos a partir de la linea To, conteniendo:) personal adl mailbox host fromaddress (la linea from: al completo, hasta 1024 caracteres) from[] (devuelve un array de objetos a partir de la linea From, conteniendo:) personal adl mailbox host ccaddress (la linea cc: al completo, hasta 1024 caracteres) cc[] (devuelve un array de objetos a partir de la linea Cc:, conteniendo:) personal adl mailbox host bccaddress (la linea bcc al completo, hasta 1024 caracteres) bcc[] (devuelve un array de objetos a partir de la linea Bcc, conteniendo:) personal adl mailbox host reply_toaddress (la linea reply_to: al completo, hasta 1024 caracteres) reply_to[] (devuelve un array de objetos a partir de la linea Reply_to, conteniendo:) personal adl mailbox host senderaddress (la linea sender: al completo, hasta 1024 caracteres) sender[] (devuelve un array de objetos a partir de la linea sender, conteniendo:) personal adl mailbox host return_path (la linea return-path: al completo, hasta 1024 caracteres) return_path[] (devuelve un array de objetos a partir de la linea return_path, conteniendo:) personal adl mailbox host udate (fecha del mensaje en formato unix) fetchfrom (la linea from formateada hasta ajustarse a los caracteres indicados en fromlength) fetchsubject (la linea subject formateada hasta ajustarse a los caracteres indicados en subjectlength)

source: Returns an array of string formatted with header info.
es: Devuelve un array de cadenas formateadas con informacion de la cabecera.

source: One element per mail message.
es: Un elemento por mensaje de correo.

source: This function returns the full text of the last IMAP error message that occurred on the current page.
es: Esta función devuelve el texto completo del último error IMAP que ocurrió en la pagina actual.

source: The error stack is untouched; calling imap_last_error() subsequently, with no intervening errors, will return the same error.
es: ATENCIàN: esta función no esta disponible aún en PHP4.

source: Example 1. imap_list() example
es: Ejemplo 1. imap_list() example

source: This function is an alias to imap_list() and is identical to it in every way.
es: Devuelve un array que contiene los nombres de los buzones.

source: This function is an alias to imap_lsub() and is identical to it in every way.
es: Los parámetros ref y pattern especifican la localización desde donde comenzará a buscar y el patrón que el nombre del buzón debe encontrar.

source: Returns FALSE on failure.
es: Devuelve información acerca del buzón actual.

source: The imap_mailboxmsginfo() The imap_mailboxmsginfo() function checks the current mailbox status on the server.
es: Devuelve FALSE en caso de fallo.

source: It returns the information in an object with following properties.
es: La función imap_mailboxmsginfo() comprueba el estado del buzón actual en el servidor y devuelve la información en un objeto con las siguientes propiedades.

source: ?php $mbox = imap_open( "{your.imap.host}INBOX" ,"username", "password") or die("can't connect: ".imap_last_error()); $check = imap_mailboxmsginfo($mbox); if($check) {print "Date: ". $check - Date." br \n "; print "Driver:". $check - Driver. "br \n"; print "Mailbox: ". $check - Mailbox." br \n "; print "Messages:". $check - Nmsgs. "br \n"; print "Recent: ". $check - Recent." br \n "; print "Unread:". $check - Unread. "br \n"; print "Deleted: ". $check - Deleted." br \n "; print "Size:". $check - Size. "br \n";} else {print "imap_check() failed: ".imap_last_error(). "br \n";} imap_close($mbox);?
es: Date: fecha del mensaje Driver: driver Mailbox: nombre del buzón Nmsgs: número de mensajes Recent: número de los mensajes recientes Unread: número de los mensajes no leidos Size: tama¤o del buzon

source: Example 1. imap_mail_compose() example
es: Ejemplo 1. imap_mail_compose() example

source: Copies mail messages specified by msglist to specified mailbox. msglist is a range not just message numbers (as described in RFC2060).
es: Copia los mensajes especificados por msglist a un buzón especificado. msglist es un rango no números de mensajes.

source: Flags is a bitmask of one or more of
es: Flags es una máscara de bit de uno o más

source: CP_UID - the sequence numbers contain UIDS
es: CP_UID - los números de secuencia contienen UIDS

source: CP_MOVE - Delete the messages from the current mailbox after copying
es: CP_MOVE - Elimina los mensajes del buzon actual despues de copiarlos

source: Moves mail messages specified by msglist to specified mailbox. msglist is a range not just message numbers (as described in RFC2060).
es: Mueve los mensajes especificados por msglist al buzón especicifado. msglist es un rango no números de mensajes.

source: Example 1. imap_mime_header_decode() example
es: Ejemplo 1. imap_mime_header_decode() example

source: This function returns the message sequence number for the given UID.
es: Esta función devuelve el número de secuencia del mensaje para el UID dado.

source: It is the inverse of imap_uid().
es: Esta función es la inversa a imap_uid().

source: See also: imap_num_recent() and imap_status().
es: Devuelve el número de mensajes en el buzón actual.

source: See also: imap_num_msg() and imap_status().
es: Devuleve el número de mensajes recientes en el buzón actual.

source: This function can also be used to open streams to POP3 and NNTP servers, but some functions and features are only available on IMAP servers.
es: Devuleve la sesion IMAP si no hay error y FALSE en caso contrario.

source: The special name INBOX stands for the current users personal mailbox.
es: Esta función también puede ser usada para abrir sesiones con servidores POP3 y NNTP.

source: The server part is mandatory in all mailbox parameters.
es: Para conectarse a un servidor IMAP escuchando por el puerto 143 en una máquina local, haga lo siguiente:

source: Mailbox names that contain international characters besides those in the printable ASCII space have to be encoded with imap_utf7_encode().
es: $mbox = imap_open( "{localhost:143}INBOX" ,"user_id" ,"password");

source: OP_READONLY - Open mailbox read-only
es: $mbox = imap_open( "{localhost / pop3:110}INBOX" ,"user_id" ,"password");

source: OP_ANONYMOUS - Dont use or update a .newsrc for news (NNTP only)
es: $nntp = imap_open( "{localhost / nntp:119}comp.test" ,"" ,"");

source: CL_EXPUNGE - Expunge mailbox automatically upon mailbox close
es: Las opciones son una máscara de bit con una o más de los siguientes:

source: To connect to an IMAP server running on port 143 on the local machine, do the following:
es: OP_READONLY - Abre el buzón en modo de sólo lectura

source: $mbox = imap_open ("{localhost:110 / pop3}INBOX", "user_id", "password");
es: OP_ANONYMOUS - No usa o actualiza un .newsrc para las noticias

source: $mbox = imap_open ("{localhost:995 / pop3 / ssl / novalidate-cert}", "user_id", "password");
es: OP_HALFOPEN - Para nombres IMAP y NNTP, abre una conexión pero no abre un buzón

source: Example 1. imap_open() example
es: CL_EXPUNGE - Purga automaticamente el buzón antes de cerrar la sesión

source: Returns TRUE if the stream is still alive, FALSE otherwise.
es: Devuelve TRUE si la sesión está activa, FALSE en caso contrario.

source: imap_ping() function pings the stream to see it is still active.
es: La función imap_ping() pings the stream to see it is still active.

source: It may discover new mail; this is the preferred method for a periodic "new mail check "as well as a "keep alive" for servers which have inactivity timeout. (As PHP scripts do not tend to run that long, i can hardly imagine that this function will be usefull to anyone.)
es: Esto puede descubrir que hay correo nuevo; este es el método preferido para hacer una comprobación periodica del buzón, asi como para mantener activa sesiones en servidores que tienen inactivity timeout.

source: Convert a quoted-printable string to an 8 bit string (according to RFC2045, section 6.7).
es: Convierte una cadena quoted-printable a una cadena de 8 bit

source: See also imap_8bit().
es: Devuelve una cadena de 8 bit (binary)

source: This function renames on old mailbox to new mailbox (see imap_open() for the format of mbox names).
es: Esta función renombra un buzon (ver imap_open() para el formato del parámetro mbox).

source: See also imap_createmailbox(), imap_deletemailbox(), and imap_open() for the format of mbox.
es: Ver También imap_createmailbox() and imap_deletemailbox().

source: This function reopens the specified stream to a new mailbox on an IMAP or NNTP server.
es: Devuelve TRUE si no hay error y FALSE en caso contrario.

source: OP_HALFOPEN - For IMAP and NNTP names, open a connection but dont open a mailbox.
es: OP_ANONYMOUS - No usa o actualiza .newsrc para noticias

source: CL_EXPUNGE - Expunge mailbox automatically upon mailbox close (see also imap_delete() and imap_expunge())
es: OP_HALFOPEN - Para nombres IMAP y NNTP, abre una conexión pero no abre el buzon.

source: mailbox - the mailbox name (username)
es: Esta función examina la cadena dirección y para cada dirección, devuelve un array de objetos.

source: personal - the personal name
es: Los 4 objetos son:

source: Example 1. imap_rfc822_parse_adrlist() example
es: mailbox - el nombre del buzón (username) host - el nombre del ordenador personal - el nombre personal adl - ruta del dominio

source: print imap_rfc822_write_address( "hartmut" ,"cvs.php.net" ,"Hartmut Holzgraefe") ."\n";
es: Devuelve una dirección de correo correctamente formateada, dado el buzón, host, e información personal.

source: This function is an alias to imap_listscan() and is identical to it in every way.
es: Devuelve un array que contiene los nombres de los buzones que tienen el parámetro string en el texto del buzón.

source: This function performs a search on the mailbox currently opened in the given imap stream. criteria is a string, delimited by spaces, in which the following keywords are allowed.
es: Esta función realiza una busqueda en el buzón actualmente abierto indicado por imap_stream. criteria es una cadena, delimitada por espacios, en la cual las siguientes palabras claves son permitidas.

source: Any multi-word arguments (eg.
es: Cualquier argumento múltiple (ej.

source: FROM "joey smith") must be quoted.
es: FROM "joey smith") debe estar entre comillas.

source: ALL - return all messages matching the rest of the criteria
es: ALL - devuelve todos los mensajes que coinciden con el resto del criterio

source: ANSWERED - match messages with the \\ANSWERED flag set
es: ANSWERED - busca mensajes con el flag \\ANSWERED activado

source: BCC "string" - match messages with "string "in the Bcc: field
es: BCC "string" - busca mensajes con "cadena "en el campo Bcc:

source: BEFORE "date" - match messages with Date: before "date "
es: BEFORE "date" - busca mensajes con Date: antes de "date "

source: BODY "string" - match messages with "string "in the body of the message
es: BODY "string" - busca mensajes con "cadena "en el cuerpo del mensaje

source: CC "string" - match messages with "string "in the Cc: field
es: CC "string" - busca mensajes con "cadena "en el campo Cc:

source: DELETED - match deleted messages
es: DELETED - busca mensajes eliminados

source: FLAGGED - match messages with the \\FLAGGED (sometimes referred to as Important or Urgent) flag set
es: FLAGGED - busca mensajes con el flag \\FLAGGED (sometimes referred to as Important or Urgent) activado

source: FROM "string" - match messages with "string "in the From: field
es: FROM "string" - busca mensajes con "cadena "en el campo From:

source: KEYWORD "string" - match messages with "string "as a keyword
es: KEYWORD "string" - busca mensajes con "cadena "como una palabra clave

source: NEW - match new messages
es: NEW - busca mensajes nuevos

source: OLD - match old messages
es: OLD - busca mensajes viejos

source: ON "date" - match messages with Date: matching "date "
es: ON "date" - busca mensajes con "date "igual a Date:

source: RECENT - match messages with the \\RECENT flag set
es: RECENT - busca mensajes con el flag \\RECENT activado

source: SEEN - match messages that have been read (the \\SEEN flag is set)
es: SEEN - busca mensajes que han sido leidos (la opcion \\SEEN activada)

source: SINCE "date" - match messages with Date: after "date "
es: SINCE "date" - busca mensajes conwith Date: after "date "

source: SUBJECT "string" - match messages with "string "in the Subject:
es: SUBJECT "string" - busca mensajes con "string "en el campo Subject:

source: TEXT "string" - match messages with text "string "
es: TEXT "string" - busca mensajes con el texto "string "

source: TO "string" - match messages with "string "in the To:
es: TO "string" - busca mensajes con "string "en el campo To:

source: UNANSWERED - match messages that have not been answered
es: UNANSWERED - busca mensajes que no han sido respondidos

source: UNDELETED - match messages that are not deleted
es: UNDELETED - busca mensajes que no han sido eliminados

source: UNFLAGGED - match messages that are not flagged
es: UNFLAGGED - busca mensajes que no estan flagged

source: UNKEYWORD "string" - match messages that do not have the keyword "string "
es: UNKEYWORD "string" - busca mensajes que no coinciden con la palabra clave "string "

source: UNSEEN - match messages which have not been read yet
es: UNSEEN - busca mensajes que no han sido leidos aún

source: For example, to match all unanswered messages sent by Mom, you' d use: "UNANSWERED FROM mom ".
es: Por ejemplo, para buscar todos los mensajes no contestados enviados por Mamá, usaría: "UNANSWERED FROM mamá".

source: Searches appear to be case insensitive.
es: La busqueda parece ser no sensitiva.

source: This list of criteria is from a reading of the UW c-client source code and may be uncomplete or inaccurate (see also RFC2060, section 6.4.4).
es: Esta lista de criterios está tomada del codigo fuente del UW c-client y puede que este incompleta o sea inexacta.

source: Valid values for flags are SE_UID, which causes the returned array to contain UIDs instead of messages sequence numbers.
es: Valores validos para los flags son SE_UID, que provoca que el array devuelto contenga UIDs en vez de los numeros de secuencia de los mensajes

source: This function causes a store to add the specified flag to the flags set for the messages in the specified sequence.
es: Esta función a¤ade el flag especificado al conjunto de flags activos para los mensajes en la secuencia especificada.

source: Example 1. imap_setflag_full() example
es: Las opciones son una máscara de bit con uno o más de los siguientes:

source: $mbox = imap_open( "{your.imap.host:143}" ,"username" ,"password") or die("can't connect: ".imap_last_error()); $status = imap_setflag_full($mbox ,"2,5" ,"\\Seen \\Flagged"); print gettype($status) ."\n"; print $status ."\n"; imap_close($mbox);
es: ST_UID El argumento sequence contiene UIDs en vez de nÃºmeros secuenciales

source: Example 1. imap_set_quota() example
es: Ejemplo 1. imap_set_quota() example

source: Returns an array of message numbers sorted by the given parameters.
es: Devuelve un array de números de mensajes ordenados por los parametros dados

source: Reverse is 1 for reverse-sorting.
es: Rev es 1 para una ordenación inversa.

source: Criteria can be one (and only one) of the following:
es: Criteria puede ser uno (y sólo uno) de los siguientes:

source: SORTDATE message Date SORTARRIVAL arrival date SORTFROM mailbox in first From address SORTSUBJECT message Subject SORTTO mailbox in first To address SORTCC mailbox in first cc address SORTSIZE size of message in octets
es: SORTDATE Fecha del mensaje SORTARRIVAL Fecha de llegada SORTFROM mailbox in first From address SORTSUBJECT Asunto del mensaje SORTTO mailbox in first To address SORTCC mailbox in first cc address SORTSIZE tamaÂ¤o del mensaje en bytes

source: The flags are a bitmask of one or more of the following:
es: Las opciones son una máscara de bit con uno o más de los siguientes:

source: SE_UID Return UIDs instead of sequence numbers SE_NOPREFETCH Don 't prefetch searched messages.
es: SE_UID Devuelve UIDs en vez de números secuenciales SE_NOPREFETCH No preselecciona los mensajes buscados.

source: This function returns an object containing status information.
es: Esta función devuelve un objeto que contiene información de estado.

source: Valid flags are:
es: Las opciones válidas son:

source: SA_MESSAGES - set status - messages to the number of messages in the mailbox
es: SA_MESSAGES - activa status - messages con el número de mensajes en el buzon

source: SA_RECENT - set status - recent to the number of recent messages in the mailbox
es: SA_RECENT - activa status - recent con el número de mensajes recientes en el buzón

source: SA_UNSEEN - set status - unseen to the number of unseen (new) messages in the mailbox
es: SA_UNSEEN - activa status - unseen con el número de mesajes no leidos (nuevos) en el buzón

source: SA_UIDNEXT - set status - uidnext to the next uid to be used in the mailbox
es: SA_UIDNEXT - activa status - uidnext con el próximo uid a usar en el bizón

source: SA_UIDVALIDITY - set status - uidvalidity to a constant that changes when uids for the mailbox may no longer be valid
es: SA_UIDVALIDITY - activa status - uidvalidity con una constante que cambia cuando los uids del buzon ya no son válidos

source: SA_ALL - set all of the above
es: SA_ALL - activa todos los de arriba

source: Example 1. imap_status() example
es: status - flags contienen una máscara de bits la cual puede ser comprobada contra cualquiera de las propiedades de arriba.

source: Subscribe to a new mailbox.
es: Da de alta un nuevo buzón.

source: This function is the inverse of imap_msgno().
es: Esta función devuelve el UID del número de secuencia del mensaje dado.

source: This is not supported by POP3 mailboxes.
es: Esta función es la inversa a imap_msgno().

source: This function removes the deletion flag for a specified message, which is set by imap_delete() or imap_mail_move().
es: Esta funcion elimina la marca de borrado de un mensaje especifico, puesta por la función imap_delete().

source: Unsubscribe from a specified mailbox.
es: Da de baja el buzón especificado.

source: Example 1. implode() example
es: Devuelve una cadena que contiene una representación de todos los elementos de la matriz en el mismo orden, pero con la cadena cola en medio de los mismos.

source: ?php $array = array( 'lastname', 'email', 'phone'); $comma_separated = implode(" ,", $array); print $comma_separated; / / lastname,email,phone?
es: Ejemplo de implode()

source: For consistency with explode(), however, it may be less confusing to use the documented order of arguments.
es: $separada_dospuntos = implode (":", $matrizay);

source: See also explode(), and split().
es: Vea también explode(), join(), y split().

source: Example 1. in_array() example
es: Ejemplo de in_array()

source: The second condition fails because in_array() is case-sensitive, so the program above will display:
es: $os = array ("Mac", "NT", "Irix", "Linux"); if (in_array ("Irix", $os)) print "Encontrado Irix";

source: Example 2. in_array() with strict example
es: Nota:

source: This will display:
es: Esta función fue añadida en el PHP 4.0.

source: Chapter 12.
es: Capítulo 12.

source: Control Structures
es: Estructuras de Control

source: The include() statement includes and evaluates the specified file.
es: La sentencia include() incluye y evalúa el archivo especificado.

source: The two constructs are identical in every way except how they handle failure. include() produces a Warning while require() results in a Fatal Error.
es: Si "URL fopen wrappers" esta activada en PHP (como está en la configuración inicial), se puede especificar el fichero que se va a incluir usando una URL en vez de un fichero local (con su Path) Ver Ficheros remotos y fopen() para más información.

source: Be sure to have an appropriate include_path setting as well.
es: Un punto importante sobre su funcionamiento es que cuando un archivo se incluye con include() o se requiere con require(), el intérprete sale del modo PHP y entra en modo HTML al principio del archivo referenciado, y vuelve de nuevo al modo PHP al final.

source: When a file is included, the code it contains inherits the variable scope of the line on which the include occurs.
es: Por esta razón, cualquier código dentro del archivo referenciado que debiera ser ejecutado como código PHP debe ser encerrado dentro de etiquetas válidas de comienzo y fin de PHP.

source: Example 12-3.
es: Esto sucede cada vez que se encuentra la sentencia include(), así que se puede usar una sentencia include() dentro de una estructura de bucle para incluir un número de archivos diferentes.

source: Basic include() example
es: include() difiere de require() en que la sentencia include se re-evalúa cada vez que se encuentra (y sólo cuando está siendo ejecutada), mientras que la sentencia require() se reemplaza por el archivo referenciado cuando se encuentra por primera vez, se vaya a evaluar el contenido del archivo o no (por ejemplo, si está dentro de una sentencia if cuya condición evaluada es falsa).

source: vars.php ?php $color = 'green'; $fruit = 'apple';? test.php ?php echo "A $color $fruit"; / / A include'vars.php'; echo "A $color $fruit"; / / A green apple?
es: Debido a que include() es una construcción especial del lenguaje, se debe encerrar dentro de un bloque de sentencias si está dentro de un bloque condicional.

source: If the include occurs inside a function within the calling file, then all of the code contained in the called file will behave as though it had been defined inside that function.
es: /* Esto es ERRÓNEO y no funcionará como se desea. * / if ($condicion) include($archivo); else include($otro); / * Esto es CORRECTO. * / if ($condicion) {include($archivo);} else {include($otro);}

source: Example 12-4.
es: En ambos, PHP3 y PHP4, es posible ejecutar una sentencia return dentro de un archivo incluido con include(), para terminar el procesado de ese archivo y volver al archivo de comandos que lo llamó.

source: ?php function foo() {global $color; include'vars.php'; echo "A $color $fruit";} / * vars.php is in the scope of foo() so * * $fruit is NOT available outside of this * * scope. $color is because we declared it * * as global. * / foo(); / / A green apple echo "A $color $fruit"; / / A green?
es: La primera es que en PHP3, return no puede aparecer dentro de un bloque a menos que sea un bloque de función, en el cual return se aplica a esa función y no al archivo completo.

source: When a file is included, parsing drops out of PHP mode and into HTML mode at the beginning of the target file, and resumes again at the end.
es: También, PHP4 permite devolver valores desde archivos incluidos con include().

source: For this reason, any code inside the target file which should be executed as PHP code must be enclosed within valid PHP start and end tags.
es: Esto genera un error de intérprete en PHP3.

source: If "URL fopen wrappers" are enabled in PHP (which they are in the default configuration), you can specify the file to be included using an URL (via HTTP or other supported wrapper - see Appendix I for a list of protocols) instead of a local pathname.
es: Asumamos la existencia del siguiente archivo (llamado test.inc) en el mismo directorio que el archivo principal:

source: If the target server interprets the target file as PHP code, variables may be passed to the included file using an URL request string as used with HTTP GET.
es: Asumamos que el archivo principal (main.html) contiene lo siguiente:
